from collections import deque  # Імпорт deque з модуля collections для використання двосторонньої черги
import string  # Імпорт модуля string для роботи зі строковими константами

def is_palindrome(input_string): 
    # Видалення пробілів та переведення рядка у нижній регістр.
    # З рядка видаляються всі символи, які не є буквами (з англійського алфавіту та з українського).
    cleaned_string = ''.join(ch for ch in input_string.lower() if ch in string.ascii_letters or ch in 'абвгґдеєжзиіїйклмнопрстуфхцчшщьюя')
    
    # Створення двосторонньої черги, де кожен символ з cleaned_string додається як окремий елемент.
    char_deque = deque(cleaned_string)
    
    # Порівнюються символи з обох кінців черги, поки в черзі не залишиться один або жодного символу.
    while len(char_deque) > 1:  # Поки в черзі більше одного символу
        # Вилучається перший і останній символ; якщо вони не співпадають, рядок не є паліндромом.
        if char_deque.popleft() != char_deque.pop():
            return False
    # Якщо всі порівняння пройдено успішно, рядок є паліндромом.
    return True

# Тестування функції на українських словах та фразах.
test_words = ["А роза упала на лапу Азора", "Аргентина манить негра", "Не паліндром", "ії", "Леон у кіно"]
# Створення словника з результатами тестування: ключ - слово, значення - результат виклику функції is_palindrome.
results = {word: is_palindrome(word) for word in test_words}
# Виведення результатів
results
